import React from "react";
import { upPage } from "../../../scripts";

import AboutCompanyImage from "../../../assets/images/footer_image/about-company-image.png"

import './AboutCompany.scss'


function AboutCompany() {
  upPage()
  return (
      <div className="about-company-page">
            <div className="about-company-block">
              <div className="about-company-first-paragraph">
                <p className="first-paragraph">« <p className="logo-text">Loffy</p> » - cпеціалізується на продажі якісних товарів за доступними цінами.
                  Назва « <p className="logo-text">Loffy</p> » походить від англійського слова « <p className="logo-text">lofty</p> », що означає « високий ». Це відображає високий рівень якості товарів та послуг, а також прагнення досягти високих результатів та встановлення високих стандартів у сфері електронної комерції.
                  </p>
                                
              </div>
                <div className="about-company-second-paragraph">
                <p className="second-paragraph">Коли треба купити електро-техніку багато людей вибирають дешевий варіант, а потім скаржаться на якість і швидкий вихід зі строю. Купити якісний товар недорого навіть почало звучати для багатьох людей як жарт багачів, особливо коли це про електро-техніку. А якщо і спробувати купити дорогий товар то можна загубитись у потоці вигаданного тексту лише б продати товар подорожче. Стереотипи про якість товарів таких країн як Німетчина, Японія, Америка лише виграють завдяки своєму імені.
                Звісно всі компанії намагаються продати свій товар по вигідній для них ціні, але Loffy, <p className="logo-text">ще й піклується про своїх покупців як про рідних братів</p> . Україна вийшла на новий рівень єлектронної комерції. Її ім'я не лише озвучує стереотипно <p className="logo-text">якість</p> товару але й підтверджує <p className="logo-text">її на високому рівні</p>. Доступні ціни на якісні товари не лише задовольняють кліента, а також допомагають компанії вийти у своїх обладнаннях та професійності на вищий рівень. Опис товару максимально детальний наскільки це можливо, можливість взвішувати товари для вибору кращого саме для вас. Гарантія товару при можливості виходу зі строю товара заради вашої безпеки вибору.
                У ближайших магазинах нашого бренду завжди знайдуться <p className="logo-text">люди кваліфіковані</p>  достатьо для допомоги та мінімілізації верогідності розачарування з вашої сторони, як справжні побратими.
                </p>
                </div>
                <div className="about-company-third-paragraph">
                <p className="third-paragraph">Причиною створення нової комерційної інтернет платформи було надання клієнтам можливість <p className="logo-text">купувати якісні українські єлектроприлади за вигідними цінами</p> . Надання додаткових послуг з <p className="logo-text">гарантійного обслуговування</p> , встановлення та налаштування техніки. Можливість придбання товарів у кредит на вигідних умовах одного з провідних банків України. Вичерпна інформація про кожен товар, включаючи реальні фото, матеріали виготовлення. Продаж тільки сертифікованої техніки та електроніки, яка пройшла всі етапи тестування та затверджена фахівцями. Надання двох видів гарантії - від магазину Loffy та офіційного виробника. Програма розширеного сервісу (ПРС), яка робить гарантійні умови ще більш прийнятними для покупця. Можливість повернення товару протягом 30 днів після отримання, за дотримання правил, встановлених законом “Про захист прав споживачів”
                Loffy пропонує перелік товарів, починаючи від ігрових консолей та закінчуючи аксессуарами, закінчуючи ігровими консолями. Ця система грунтуеться на Comfy.ua, а інтерфейс користувача модернізован.
                </p>
                </div>
                <div className="image-block">
                  <img className="about-company-image" src={AboutCompanyImage} alt=""/>
                </div>
            </div>
      </div>
        
  );
}

export default AboutCompany;