import React from "react";
import { upPage } from "../../../scripts";


import './Payment.scss'


function Payment() {
  upPage()
  return (
    <div className="payment-page">
    <div className="payment-block">
    <p className="payment-title"> Loffy: Швидка та безпечна оплата ваших покупок</p>
    <div className="payment-first-paragraph">
      <p className="payment-first-paragraph">Ласкаво просимо на сторінку оплати на Loffy! Ми розуміємо, що швидка та безпечна оплата є важливим кроком при здійсненні покупок онлайн. Тому ми зробили все можливе, щоб забезпечити зручність та безпеку при оплаті ваших замовлень.
Ми пропонуємо декілька зручних способів оплати:</p>
    <ul>
     <li>Кредитні та дебетові картки: Ми приймаємо оплату за допомогою всесвітньо відомих кредитних та дебетових карток, таких як Visa, Mastercard, American Express та інші. Просто введіть необхідні дані вашої картки на захищеній сторінці оплати, і ваш платіж буде оброблений швидко та безпечно.</li>
     <li>Електронні платіжні системи: Ми також підтримуємо популярні електронні платіжні системи, такі як PayPal, Apple Pay, Google Pay та інші. Ці системи дозволяють здійснювати оплату без необхідності вводити дані вашої картки на нашому сайті, забезпечуючи додатковий рівень безпеки та зручності.</li>
     <li>Банківські перекази: Для тих, хто віддає перевагу банківському переказу, ми надаємо відповідні реквізити для здійснення оплати через ваш банк. Після здійснення переказу, будь ласка, забезпечте нам підтвердження оплати, щоб ми могли швидко обробити ваше замовлення.</li>
     </ul>
      <p className="payment-second-paragraph">Ми робимо все можливе, щоб забезпечити безпеку вашої оплати. Наша платіжна система використовує шифрування та захищені протоколи, що дозволяють передавати ваші платіжні дані безпечно. Ми також не зберігаємо ваші кредитні або дебетові картки у нашій системі, забезпечуючи додатковий рівень захисту ваших особистих даних.

Після підтвердження оплати, ви отримаєте повідомлення з підтвердженням вашого замовлення і деталями доставки. Якщо у вас виникнуть будь-які питання або проблеми щодо оплати, будь ласка, зв'яжіться з нашою підтримкою, і ми з радістю допоможемо вам.

Дякуємо, що обрали Loffy для своїх покупок. Ми робимо все можливе, щоб ваша оплата була швидкою, безпечною та зручною.

З повагою,
Команда Loffy</p>
    </div>
    </div>
</div>
        
  );
}

export default Payment;