import React from "react";
import { upPage } from "../../../scripts";
import  Icon from "../../../components/icon/icon";


import './Security.scss'


function Security() {
  upPage()
  return (
    <div className="security-page">
    <div className="security-block">
    <p className="security-title">Політика конфіденційності</p>
    <div className="security-first-paragraph">
      <p>
"Політика конфіденційності Loffy: Захист вашої приватності" В Loffy ми дуже серйозно ставимося до питання конфіденційності і захисту ваших персональних даних. Ця політика конфіденційності пояснює, яку інформацію ми збираємо, як ми використовуємо цю інформацію та як ми захищаємо ваші дані.</p>

    <ul>
      <li>Збір інформації:
Ми можемо збирати різноманітну інформацію, включаючи ваше ім'я, електронну адресу, контактні дані, інформацію про покупки та інші дані, які ви надаєте нам під час використання нашого маркетплейсу.</li>
      <li>Використання інформації:
Ми використовуємо зібрану інформацію для обробки замовлень, надання послуг, взаємодії з вами, надсилання оновлень та пропозицій, а також для поліпшення нашого сервісу та персоналізації ваших досвідів.</li>
      <li>Захист і безпека:
Ми застосовуємо технічні та організаційні заходи для захисту вашої інформації від несанкціонованого доступу, втрати, зміни або розголошення. Ми дотримуємо всіх необхідних стандартів і процедур для забезпечення безпеки даних.</li>
      <li>Розкриття інформації третім сторонам:
Ми можемо розкривати вашу інформацію третім сторонам лише в обмеженому обсязі, якщо це необхідно для надання послуг, виконання юридичних обов'язків або за вашої згоди. Ми ретельно обираємо партнерів і забезпечуємо, що вони так само дотримуються політики конфіденційності.</li>
      <li>Контроль над вашою інформацією:
Ви маєте право отримати доступ до своїх персональних даних, внести зміни або видалити їх за вашим бажанням. Ви також можете відмовитися від отримання маркетингових повідомлень від нас.</li>
    </ul>

    </div>
    <div className="security-second-paragraph">
    Ми рекомендуємо вам ознайомитися з політикою конфіденційності, щоб краще розуміти, як ми обробляємо вашу інформацію. Ця політика може час від часу змінюватися, і будь-які оновлення будуть розміщені на нашому веб-сайті.

Якщо у вас є будь-які питання або проблеми щодо нашої політики конфіденційності, будь ласка, зв'яжіться з нами. Ми завжди готові надати вам необхідну допомогу та пояснення.

Дякуємо за довіру, яку ви нам надаєте. Ми прагнемо забезпечити вам високий рівень конфіденційності та захисту даних у всіх аспектах нашої діяльності.

З повагою,
Команда Loffy
    </div>
    </div>
</div>
  );
}

export default Security;