import React from "react";
import { upPage } from "../../../scripts";


import './CashlessPayment.scss'


function CashlessPayment() {
  upPage()
  return (
    <div className="cashless-payment-page">
    <div className="cashless-payment-block">
    <p className="cashless-payment-title">Безготівковий рахунок Loffy: Зручний спосіб оплати та управління фінансами</p>
    <div className="cashless-payment-first-paragraph">
      <p>
      Ласкаво просимо на сторінку безготівкового рахунку Loffy! Наш безготівковий рахунок - це зручний і безпечний спосіб здійснювати покупки на нашому маркетплейсі та керувати своїми фінансами.
Ось переваги безготівкового рахунку Loffy:</p>
    <ul>
      <li>Зручна оплата: Ви можете поповнювати свій рахунок на Loffy зручним для вас способом, включаючи кредитні та дебетові картки, банківські перекази або електронні платіжні системи. Поповнення рахунку є швидким та безпечним, і ви можете використовувати гроші на рахунку для оплати своїх покупок без необхідності вводити платіжні дані кожного разу.</li>
    <li>Зберігання коштів: Ваш безготівковий рахунок Loffy дозволяє зберігати кошти в безпечному середовищі. Ви можете поповнювати рахунок в будь-який час та використовувати його для покупок на нашому маркетплейсі. Це дозволяє вам зручно управляти своїми фінансами і контролювати витрати.</li>
   <li>Швидкість і ефективність: Завдяки безготівковому рахунку ви можете швидко здійснювати оплату своїх замовлень. Немає необхідності вводити дані вашої картки або переказувати гроші кожного разу. Просто виберіть свій безготівковий рахунок як спосіб оплати, і оплата буде здійснена швидко та без зайвих турбот.</li>
   <li>Звітність і контроль: Ви можете в будь-який час переглянути стан свого безготівкового рахунку, включаючи історію транзакцій та залишок коштів. Це допомагає вам контролювати свої витрати та вести облік своїх фінансів.</li>
   <li>Безпека та конфіденційність: Ми забезпечуємо високий рівень безпеки для вашого безготівкового рахунку Loffy. Ми використовуємо шифрування та захищені протоколи, щоб забезпечити безпечну обробку вашої фінансової інформації.</li>
   </ul>

    </div>
    <div className="cashless-payment-second-paragraph">
    З безготівковим рахунком Loffy ви отримуєте зручну та безпечну оплату ваших покупок, а також більший контроль над своїми фінансами. Це дозволяє вам насолоджуватися покупками на Loffy без зайвих турбот та зручно управляти своїми коштами.

Якщо у вас є будь-які питання щодо безготівкового рахунку Loffy, будь ласка, звертайтеся до нашої підтримки. Ми завжди готові надати вам необхідну допомогу та пояснення.

Дякуємо, що обрали Loffy. Ми робимо все можливе, щоб ваші покупки були зручними та безпечними.

З повагою,
Команда Loffy
    </div>
    </div>
</div>

  );
}

export default CashlessPayment;