import React, { useEffect, useState } from "react";
import "./About.scss"

function About() {


  return (
    <main>
        <div className="page-info-block">
            <div className="page-info-text">
                <div>
                    <p>
                        LOFFY — перший омніканальний ритейлер побутової техніки та
                        електроніки в Україні. Компанія є лідером за обсягом продажів та
                        ефективністю в галузі. Станом на 31 грудня 2022 року мережа LOFFY налічує -1 магазинів,
                        а сайт Loffy.ua стабільно входить до Топ-5 найбільших онлайн-гравців українського ринку.
                    </p>
                </div>
                <div>
                     <p>
                        LOFFY — соціально відповідальна компанія. 
                        На тлі тривалої військової агресії та повномасштабного вторгнення росії, 
                        один з пріоритетних напрямів соціальної відповідальності компанії була та залишається допомога
                        українському війську та волонтерам. Загальний обсяг сягнув 100 мільйонів гривень. 
                        Також компанія підтримує екологічні ініціативи,
                        спрямовані на відповідальне споживання природних ресурсів та утилізацію відходів.
                    </p>
                </div>
                <div>
                    <p> 
                     Важливою складовою стратегії розвитку компанії є прозора та ефективна діяльність. 
                     Тому LOFFY:
                     з 2011 року проходить аудиторську перевірку у провідних компаній "Великої четвірки",
                     продає виключно офіційну та сертифіковану техніку від провідних виробників та постачальників,
                     відповідально ставиться до виконання зобов’язань перед державою та традиційно входить до Топ-100 найбільших платників податків України.
                    </p>
                </div>
            </div>
            <div className="page-info-buttons">
                <ul className="buttons-list">
                    <li>Про компанію</li>
                    <li>Історія Компанії</li>
                    <li>Керівництво</li>
                    <li>Відзнаки та нагороди</li>
                    <li>Магазини</li>
                    <li>Контакти</li>
                    <li>Работа в компанії</li>
                    <li>Політика конфеденційності</li>
                    <li>Тендер</li>
                    <li>Партнерам</li>
                    <li>Гарантія</li>
                </ul>
            </div>
        </div> 
        
    </main>
  );
}

export default About;
