import React from "react";
import { upPage } from "../../../scripts";


import './Guarantee.scss'


function Guarantee() {
  upPage()
  return (
    <div className="guarantee-page">
    <div className="guarantee-block">
    <p className="guarantee-title">Гарантія на Loffy: Захист вашої покупки та задоволення від сервісу</p>
    <div className="guarantee-first-paragraph">
      <p>
      Ласкаво просимо на сторінку гарантії на Loffy! Ми розуміємо, що важливо мати впевненість в якості товарів, які ви придбали, та отримувати найкращий сервіс для вашої покупки. Тому ми надаємо гарантію, що ви будете задоволені своїми покупками на Loffy.
Основні принципи нашої гарантії:</p>
    <ul>
      <li>Якість товарів: Ми співпрацюємо тільки з надійними продавцями та постачальниками, які пропонують якісні товари. Ми ретельно відбираємо продукти, що продаються на нашому маркетплейсі, та забезпечуємо, що вони відповідають нашим високим стандартам якості.</li>
    <li>Повернення та обмін: Якщо ви не задоволені отриманим товаром, ми надаємо можливість повернення або обміну протягом певного періоду. Зверніться до наших умов повернення, щоб ознайомитися з деталями та процедурою здійснення повернень або обміну.</li>
   <li>Швидкість і ефективність: Завдяки безготівковому рахунку ви можете швидко здійснювати оплату своїх замовлень. Немає необхідності вводити дані вашої картки або переказувати гроші кожного разу. Просто виберіть свій безготівковий рахунок як спосіб оплати, і оплата буде здійснена швидко та без зайвих турбот.</li>
   <li>Користувачська підтримка: Наша команда користувачської підтримки працює, щоб вам було зручно та комфортно. Якщо у вас є будь-які питання, проблеми або потреба в допомозі, будь ласка, звертайтеся до нас. Ми старанно працюємо, щоб надати вам необхідну підтримку та вирішити будь-які питання, що виникають.</li>
   <li>Безпека покупок: Ми робимо все можливе, щоб забезпечити безпеку ваших покупок на Loffy. Ми використовуємо захищені протоколи та шифрування для забезпечення безпечності вашої інформації та платежів. Ми також дотримуємо високих стандартів конфіденційності та захисту даних.</li>
   </ul>

    </div>
    <div className="guarantee-second-paragraph">
    Наша гарантія призначена для того, щоб ви мали впевненість у вашому виборі та отримували задоволення від вашої покупки на Loffy. Ми прагнемо забезпечити вам найкращий досвід покупок та перевершити ваші очікування.

Якщо у вас є будь-які питання щодо нашої гарантії або потреба в додатковій інформації, будь ласка, звертайтеся до нашої підтримки. Ми завжди готові допомогти вам та забезпечити вам максимальну задоволеність від вашої покупки.

Дякуємо, що обрали Loffy. Ми дбаємо про вашу покупку, вашу задоволеність та ваше довір'я.

З повагою,
Команда Loffy
    </div>
    </div>
</div>

  );
}

export default Guarantee;