import React, { useEffect, useState } from "react";
//Components
import  Card                from "../../../components/card/Card";
import  Icon                from "../../../components/icon/icon";
//styles
import './UserReviews.scss'


function Reviews() {
  return (
            <div className="reviews-block">
              <div className="reviews-title">
                  Ваші відгуки
                </div>
                <div className="reviews">
                    <div className="review">
                      <div className="review-title">
                        Відгук про товар 
                      </div> 
                      <div className="review-product-name">
                        Ноутбук Apple MacBook Pro 14'' M2 Pro 1TB MPHF3 Space Gray
                      </div>
                      <div className="border"></div>
                      <div className="review-body">
                        <div className="rtitle">
                          Відгук
                        </div> 
                        <div className="text">
                        Дуже сподобався! Дякую консультантам магазина Comfy! Влаштовуємо з друзями гриль вечірки! Друзі приїжджають до мене та я з гриль приїжджаю до друзів! Для поверхонь гриль хотілося б спеціальний портфель з відділеннями, для безпечного переміщення!
                        </div>
                      </div>
                      <div className="border"></div>
                      <div className="review-body">
                        <div className="rtitle">
                          Плюси
                        </div> 
                        <div className="text">
                        Зручність та практичність
                        </div>
                      </div>
                      <div className="border"></div>
                      <div className="review-body">
                        <div className="rtitle">
                          Недоліки
                        </div> 
                        <div className="text">
                        Не має портфеля для переміщення поверхонь гриль
                        </div>
                      </div>
                      <div className="border"></div>
                      <div className="review-rating-data">
                        <div className="review-rating">
                          Оцінка відгука
                          <div className="rating">
                            <div class="star-rating-product-page"><div class="star" data-star="1"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div><div class="star" data-star="2"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div><div class="star" data-star="3"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div><div class="star" data-star="4"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div><div class="star" data-star="5"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div></div>
                          </div>
                        </div>
                        <div className="review-data">
                          23.06.2024
                        </div>
                      </div>
                    </div>
                    <div className="review">
                      <div className="review-title">
                        Відгук про товар 
                      </div> 
                      <div className="review-product-name">
                        Ноутбук Apple MacBook Pro 14'' M2 Pro 1TB MPHF3 Space Gray
                      </div>
                      <div className="border"></div>
                      <div className="review-body">
                        <div className="rtitle">
                          Відгук
                        </div> 
                        <div className="text">
                        Дуже сподобався! Дякую консультантам магазина Comfy! Влаштовуємо з друзями гриль вечірки! Друзі приїжджають до мене та я з гриль приїжджаю до друзів! Для поверхонь гриль хотілося б спеціальний портфель з відділеннями, для безпечного переміщення!
                        </div>
                      </div>
                      <div className="border"></div>
                      <div className="review-body">
                        <div className="rtitle">
                          Плюси
                        </div> 
                        <div className="text">
                        Зручність та практичність
                        </div>
                      </div>
                      <div className="border"></div>
                      <div className="review-body">
                        <div className="rtitle">
                          Недоліки
                        </div> 
                        <div className="text">
                        Не має портфеля для переміщення поверхонь гриль
                        </div>
                      </div>
                      <div className="border"></div>
                      <div className="review-rating-data">
                        <div className="review-rating">
                          Оцінка відгука
                          <div className="rating">
                            <div class="star-rating-product-page"><div class="star" data-star="1"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div><div class="star" data-star="2"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div><div class="star" data-star="3"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div><div class="star" data-star="4"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div><div class="star" data-star="5"><svg width="23" height="23" viewBox="0 0 38 37" xmlns="http://www.w3.org/2000/svg"><path d="M14.6022 1.70485C15.2093 -0.120084 17.7907 -0.120085 18.3978 1.70485L20.8717 9.14194C21.1436 9.95922 21.9082 10.5106 22.7695 10.5106H30.6736C32.6224 10.5106 33.4203 13.0138 31.831 14.1417L25.5181 18.6216C24.8006 19.1308 24.5001 20.0491 24.7778 20.884L27.2081 28.1898C27.8183 30.0242 25.7295 31.571 24.1529 30.4522L17.6575 25.8427C16.9642 25.3507 16.0358 25.3507 15.3425 25.8427L8.84708 30.4522C7.27051 31.571 5.18165 30.0242 5.79187 28.1898L8.2222 20.884C8.49992 20.0491 8.19943 19.1308 7.48191 18.6216L1.16897 14.1417C-0.420333 13.0138 0.377607 10.5106 2.32643 10.5106H10.2305C11.0918 10.5106 11.8564 9.95922 12.1283 9.14194L14.6022 1.70485Z" fill="#B1B7BA"></path></svg></div></div>
                          </div>
                        </div>
                        <div className="review-data">
                          23.06.2024
                        </div>
                      </div>
                    </div>
                </div>
                
            </div>
  );
}

export default Reviews;